projects/03_OpenFOAM_Schaefer_Turek_2D2_Benchmark/case/runs/run_003_fine_mesh_aborted/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

5
(
    inlet
    {
        type            patch;
        nFaces          41;
        startFace       437695;
    }
    outlet
    {
        type            patch;
        nFaces          41;
        startFace       437736;
    }
    walls
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          440;
        startFace       437777;
    }
    frontAndBack
    {
        type            patch;
        nFaces          89604;
        startFace       438217;
    }
    cylinder
    {
        type            wall;
        inGroups        List<word> 1(wall);
        nFaces          1824;
        startFace       527821;
    }
)

// ************************************************************************* //
